# Rebar Shape Terminations Data Constructor

Source: https://www.revitapidocs.com/2026/d4de16f3-3309-0a34-6b21-bcda44eafeda.htm

---

| Rebar Shape Terminations Data Constructor |
| --- |

Creates a new instance of RebarShapeTerminationData with the default values.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarShapeTerminationsData(
	Document document
)
```

```
Public Sub New (
	document As Document
)
```

```
public:
RebarShapeTerminationsData(
	Document^ document
)
```

```
new :
        document : Document -> RebarShapeTerminationsData
```

#### Parameters

document Document
:   The document containing the end treatment ids.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace